<?
// ================================================================================================
//Функция, котороя преобразовывает любое число в строку
// http://www.softtime.ru/forum/read.php?id_forum=1&id_theme=57205
// ================================================================================================

$_1_2[1]="одна ";
$_1_2[2]="дві ";

$_1_19[1]="один ";
$_1_19[2]="два ";
$_1_19[3]="три ";
$_1_19[4]="чотири ";
$_1_19[5]="п'ять ";
$_1_19[6]="шість ";
$_1_19[7]="сім ";
$_1_19[8]="вісім ";
$_1_19[9]="дев'ять ";
$_1_19[10]="десять ";

$_1_19[11]="одинадцять ";
$_1_19[12]="дванадцять ";
$_1_19[13]="тринадцять ";
$_1_19[14]="чотирнадцять ";
$_1_19[15]="п'ятнадцять ";
$_1_19[16]="шістнадцять ";
$_1_19[17]="сімнадцять ";
$_1_19[18]="вісімнадцять ";
$_1_19[19]="дев'ятнадцять ";

$des[2]="двадцять ";
$des[3]="тридцять ";
$des[4]="сорок ";
$des[5]="п'ятдесят ";
$des[6]="шістдесят ";
$des[7]="сімдесят ";
$des[8]="вісімдесят ";
$des[9]="дев'яносто ";

$hang[1]="сто ";
$hang[2]="двісті ";
$hang[3]="триста ";
$hang[4]="чотириста ";
$hang[5]="п'ятсот ";
$hang[6]="шістсот ";
$hang[7]="сімсот ";
$hang[8]="вісімсот ";
$hang[9]="дев'ятсот ";

$namerub[1]="гривня ";
$namerub[2]="гривні ";
$namerub[3]="гривень ";

$nametho[1]="тисяча ";
$nametho[2]="тисячі ";
$nametho[3]="тисяч ";

$namemil[1]="міліон ";
$namemil[2]="міліона ";
$namemil[3]="міліонів ";

$namemrd[1]="міліард ";
$namemrd[2]="міллірда ";
$namemrd[3]="міліардів ";

$kopeek[1]="копійка ";
$kopeek[2]="копійки ";
$kopeek[3]="копійок ";

// ================================================================================================
function semantic($i,&$words,&$fem,$f){
    global $_1_2, $_1_19, $des, $hang, $namerub, $nametho, $namemil, $namemrd;
    $words="";
    $fl=0;
    if($i >= 100){
        $jkl = intval($i / 100);
        $words.=$hang[$jkl];
        $i%=100;
    }
    if($i >= 20){
        $jkl = intval($i / 10);
        $words.=$des[$jkl];
        $i%=10;
        $fl=1;
    }
    switch($i){
        case 1: $fem=1; break;
        case 2:
        case 3:
        case 4: $fem=2; break;
        default: $fem=3; break;
    }
    if( $i ){
        if( $i < 3 && $f > 0 ){
            if ( $f >= 2 ) {
                $words.=$_1_19[$i];
            }
            else {
                $words.=$_1_2[$i];
            }
        }
        else {
            $words.=$_1_19[$i];
        }
    }
}

// ================================================================================================
function num2str($L){
    global $_1_2, $_1_19, $des, $hang, $namerub, $nametho, $namemil, $namemrd, $kopeek;

    $s=" ";
    $s1=" ";
    $s2=" ";
    $kop=intval( ( $L*100 - intval( $L )*100 ));
    $L=intval($L);
    if($L>=1000000000){
        $many=0;
        semantic(intval($L / 1000000000),$s1,$many,3);
        $s.=$s1.$namemrd[$many];
        $L%=1000000000;
    }

    if($L >= 1000000){
        $many=0;
        semantic(intval($L / 1000000),$s1,$many,2);
        $s.=$s1.$namemil[$many];
        $L%=1000000;
        if($L==0){
            $s.="гривень ";
        }
    }

    if($L >= 1000){
        $many=0;
        semantic(intval($L / 1000),$s1,$many,1);
        $s.=$s1.$nametho[$many];
        $L%=1000;
        if($L==0){
            $s.="гривень ";
        }
    }

    if($L != 0){
        $many=0;
        semantic($L,$s1,$many,0);
        $s.=$s1.$namerub[$many];
    }

    if($kop > 0){
        $many=0;
        semantic($kop,$s1,$many,1);
        $s.=$s1.$kopeek[$many];
    }
    else {
        $s.=" 00 копійок";
    }

    return $s;
}
// ================================================================================================

/*if( !isset($_REQUEST['per']) ) $per=NULL;
else $per = $_REQUEST['per'];

echo $per.'<br/>';
if (isset($per)){
    echo num2str($per);
}
/*?>

<FORM ACTION ="<? echo $PHP_SELF; ?>">
Введите положительное число, меньшее 10<sup>6<br>
<INPUT type="text" name="per"><BR>
<INPUT type="submit" value="Отправить">
</FORM>*/?>